conf/src/InformationRegisters/ПротоколСогласованияРесурсов/ПротоколСогласованияРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколСогласованияРесурсов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРесурса</name>
    <type>
      <types>CatalogRef.ВидыСогласуемыхРесурсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусСогласования</name>
    <type>
      <types>EnumRef.СтатусыСогласованияРесурса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ИтогиСогласованияЗадачРесурсов/ИтогиСогласованияЗадачРесурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИтогиСогласованияЗадачРесурсов</name>
  <resources>
    <name>Запланировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапланированоВДочерних</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СогласованоВДочерних</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыполненоСогласованоВДочерних</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыполненоНаСогласованииВДочерних</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗадачаПроцесса</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРесурса</name>
    <type>
      <types>CatalogRef.ВидыСогласуемыхРесурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/СтатусыСогласованияРесурса/СтатусыСогласованияРесурса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСогласованияРесурса</name>
  <enumValues>
    <name>КСогласованию</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НеСогласовано</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ЗадачиПроцесса/ЗадачиПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗадачиПроцесса</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаШаблона</name>
    <type>
      <types>CatalogRef.ЗадачиШаблонаПроцесса</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролирующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительПорученияПоЗадаче</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КрайняяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСостояниеСогласования</name>
    <type>
      <types>EnumRef.СостояниеСогласованияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗадачПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПорученияПоЗадаче</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОтработкиПоручения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоследнегоПоручения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Публикуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_ВременныйКодЗадачи</name>
    <comment>Синхронизация с редмайн</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_ВидЗадачи</name>
    <type>
      <types>CatalogRef.ЭП_ВидыЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_ПриоритетЗадачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭП_СтатусЗадачи</name>
    <type>
      <types>CatalogRef.ЭП_СтатусыЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредшествующиеЗадачи</name>
    <attributes>
      <name>ПредшествующаяЗадача</name>
      <type>
        <types>CatalogRef.ЗадачиПроцесса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколВзаимодействия</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПоручения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительПоручения</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыЗадачПроцессов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/InformationRegisters/ПротоколСогласованияРесурсов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ВыполнитьЗаписьВРегистр(ПараметрыЗаписи) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период             = ПараметрыЗаписи.Период;
	МенеджерЗаписи.Задача             = ПараметрыЗаписи.Задача;
	МенеджерЗаписи.ВидРесурса         = ПараметрыЗаписи.ВидРесурса;
	МенеджерЗаписи.СтатусСогласования = ПараметрыЗаписи.СтатусСогласования;
	МенеджерЗаписи.Количество         = ПараметрыЗаписи.Количество;
	МенеджерЗаписи.Автор              = ПараметрыЗаписи.Автор;
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура СогласоватьРесурсВЗадаче(ПараметрыСогласования) Экспорт
	
	ПараметрыЗаписи = ПараметрыЗаписи();
	
	ПараметрыЗаписи.Период             = ПараметрыСогласования.ТекущаяДата;
	ПараметрыЗаписи.Задача             = ПараметрыСогласования.Задача;
	ПараметрыЗаписи.ВидРесурса         = ПараметрыСогласования.СогласуемыйРесурс;
	ПараметрыЗаписи.СтатусСогласования = Перечисления.СтатусыСогласованияРесурса.Согласовано;
	ПараметрыЗаписи.Количество         = ПараметрыСогласования.Количество;
	ПараметрыЗаписи.Автор              = ПараметрыСогласования.Согласующий;
	
	ВыполнитьЗаписьВРегистр(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура НеСогласоватьРесурсВЗадаче(ПараметрыСогласования) Экспорт
	
	ПараметрыЗаписи = ПараметрыЗаписи();
	
	ПараметрыЗаписи.Период             = ПараметрыСогласования.ТекущаяДата;
	ПараметрыЗаписи.Задача             = ПараметрыСогласования.Задача;
	ПараметрыЗаписи.ВидРесурса         = ПараметрыСогласования.СогласуемыйРесурс;
	ПараметрыЗаписи.СтатусСогласования = Перечисления.СтатусыСогласованияРесурса.КСогласованию;
	ПараметрыЗаписи.Количество         = - ПараметрыСогласования.Количество;
	ПараметрыЗаписи.Автор              = ПараметрыСогласования.Согласующий;
	
	ВыполнитьЗаписьВРегистр(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура ЧастичноСогласоватьРесурс(ПараметрыСогласования) Экспорт
	
	Если ПараметрыСогласования.Согласуется <> 0 Тогда
		
		ПараметрыЗаписи = ПараметрыЗаписи();
		
		ПараметрыЗаписи.Период             = ПараметрыСогласования.ТекущаяДата;
		ПараметрыЗаписи.Задача             = ПараметрыСогласования.Задача;
		ПараметрыЗаписи.ВидРесурса         = ПараметрыСогласования.СогласуемыйРесурс;
		ПараметрыЗаписи.СтатусСогласования = Перечисления.СтатусыСогласованияРесурса.Согласовано;
		ПараметрыЗаписи.Количество         = ПараметрыСогласования.Согласуется;
		ПараметрыЗаписи.Автор              = ПараметрыСогласования.Согласующий;
		
		ВыполнитьЗаписьВРегистр(ПараметрыЗаписи);
		
	КонецЕсли;
	
	Если ПараметрыСогласования.НеСогласуется <> 0 Тогда
		
		ПараметрыЗаписи = ПараметрыЗаписи();
		
		ПараметрыЗаписи.Период             = ПараметрыСогласования.ТекущаяДата;
		ПараметрыЗаписи.Задача             = ПараметрыСогласования.Задача;
		ПараметрыЗаписи.ВидРесурса         = ПараметрыСогласования.СогласуемыйРесурс;
		ПараметрыЗаписи.СтатусСогласования = Перечисления.СтатусыСогласованияРесурса.КСогласованию;
		ПараметрыЗаписи.Количество         =  - ПараметрыСогласования.НеСогласуется;
		ПараметрыЗаписи.Автор              = ПараметрыСогласования.Согласующий;
		
		ВыполнитьЗаписьВРегистр(ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапланироватьРесурсВЗадаче(ПараметрыСогласования) Экспорт
	
	ПараметрыЗаписи = ПараметрыЗаписи();
	
	ПараметрыЗаписи.Период             = ПараметрыСогласования.ТекущаяДата;
	ПараметрыЗаписи.Задача             = ПараметрыСогласования.Задача;
	ПараметрыЗаписи.ВидРесурса         = ПараметрыСогласования.СогласуемыйРесурс;
	ПараметрыЗаписи.СтатусСогласования = Перечисления.СтатусыСогласованияРесурса.КСогласованию;
	ПараметрыЗаписи.Количество         = ПараметрыСогласования.Количество;
	ПараметрыЗаписи.Автор              = ПараметрыСогласования.ТекущийПользователь;
	
	ВыполнитьЗаписьВРегистр(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура ВыделитьРесурсИзЗадачи(ПараметрыСогласования) Экспорт
	
	ПараметрыЗаписи = ПараметрыЗаписи();
	
	ПараметрыЗаписи.Период             = ПараметрыСогласования.ТекущаяДата;
	ПараметрыЗаписи.Задача             = ПараметрыСогласования.Задача;
	ПараметрыЗаписи.ВидРесурса         = ПараметрыСогласования.СогласуемыйРесурс;
	ПараметрыЗаписи.СтатусСогласования = Перечисления.СтатусыСогласованияРесурса.КСогласованию;
	ПараметрыЗаписи.Количество         = - ПараметрыСогласования.Количество;
	ПараметрыЗаписи.Автор              = ПараметрыСогласования.Согласующий;
	
	ВыполнитьЗаписьВРегистр(ПараметрыЗаписи);
	
	ПараметрыЗаписи = ПараметрыЗаписи();
	
	ПараметрыЗаписи.Период             = ПараметрыСогласования.ТекущаяДата;
	ПараметрыЗаписи.Задача             = ПараметрыСогласования.Задача;
	ПараметрыЗаписи.ВидРесурса         = ПараметрыСогласования.СогласуемыйРесурс;
	ПараметрыЗаписи.СтатусСогласования = Перечисления.СтатусыСогласованияРесурса.Согласовано;
	ПараметрыЗаписи.Количество         = - ПараметрыСогласования.Количество;
	ПараметрыЗаписи.Автор              = ПараметрыСогласования.Согласующий;
	
	ВыполнитьЗаписьВРегистр(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура ЗапланироватьИСогласоватьРесурсВЗадаче(ПараметрыСогласования) Экспорт
	
	ЗапланироватьРесурсВЗадаче(ПараметрыСогласования);
	
	СогласоватьРесурсВЗадаче(ПараметрыСогласования);
	
КонецПроцедуры

Процедура ЗапланироватьИНеСогласоватьРесурсВЗадаче(ПараметрыСогласования) Экспорт
	
	ЗапланироватьРесурсВЗадаче(ПараметрыСогласования);
	
	ПараметрыСогласования.ТекущаяДата = ПараметрыСогласования.ТекущаяДата + 1;
	
	НеСогласоватьРесурсВЗадаче(ПараметрыСогласования);
	
КонецПроцедуры

#Область ВыпоолнитьОперациюИНаправитьИсполнителю

Процедура ЧастичноСогласоватьРесурсВЗадачеИНаправитьРезультатыИсполнителю(ПараметрыСогласования, ТекстПоручения, ПересчитыватьИтоги) Экспорт
	
	ЗадачаОбъект = Неопределено;
	
	Попытка
		
		НачатьТранзакцию();
		
		ЧастичноСогласоватьРесурс(ПараметрыСогласования);
		
		Если ПараметрыСогласования.ТекущийПользователь <> ПараметрыСогласования.Исполнитель Тогда
			
			ЗадачаОбъект = ПараметрыСогласования.Задача.ПолучитьОбъект();
			
			НоваяСтрокаПротокола = ЗадачаОбъект.ПротоколВзаимодействия.Добавить();
			
			НоваяСтрокаПротокола.Дата                 = ПараметрыСогласования.ТекущаяДата;
			НоваяСтрокаПротокола.Автор                = ПараметрыСогласования.ТекущийПользователь;
			НоваяСтрокаПротокола.ТекстПоручения       = ТекстПоручения;
			НоваяСтрокаПротокола.Статус               = ЗадачаОбъект.Статус;
			НоваяСтрокаПротокола.ИсполнительПоручения = ПараметрыСогласования.Исполнитель;
			
			ЗадачаОбъект.ИсполнительПорученияПоЗадаче = ПараметрыСогласования.Исполнитель;
			ЗадачаОбъект.ТекстПоследнегоПоручения     = ТекстПоручения;
			ЗадачаОбъект.ДатаПорученияПоЗадаче        = ЗадачиПроцессовКлиентСервер.ДатаПорученияПоЗадаче(ЗадачаОбъект,
			                                                                                              ПараметрыСогласования.ТекущийПользователь,
			                                                                                              ПараметрыСогласования.ТекущаяДата);
			
			ЗадачаОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьРасчет", Истина);
			ЗадачаОбъект.Записать();
			
		КонецЕсли;
		
		Если ПересчитыватьИтоги Тогда
			
			РегистрыСведений.ИтогиСогласованияЗадачРесурсов.РассчитатьВсеИтогиДляЗадачи(ПараметрыСогласования.Задача, 
			                                                                            ПараметрыСогласования.СогласуемыйРесурс);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ВывестиСообщениеОшибкаЗаписи(ЗадачаОбъект, ПараметрыСогласования.Задача);
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СогласоватьРесурсВЗадачеИНаправитьРезультатыИсполнителю(ПараметрыСогласования, ПересчитыватьИтоги, Успешно) Экспорт
	
	ЗадачаОбъект = Неопределено;
	
	Попытка
		
		НачатьТранзакцию();
		
		СогласоватьРесурсВЗадаче(ПараметрыСогласования);
	
		Если ПараметрыСогласования.ТекущийПользователь <> ПараметрыСогласования.Исполнитель Тогда
			
			ЗадачаОбъект = ПараметрыСогласования.Задача.ПолучитьОбъект();
			ТекстПоручения = ЗадачиПроцессовКлиентСервер.ТекстРезультатыСогласования(ПараметрыСогласования.ПредставлениеВидаРесурса, 
			                                                                         ПараметрыСогласования.Количество,
			                                                                         0);
			
			НоваяСтрокаПротокола = ЗадачаОбъект.ПротоколВзаимодействия.Добавить();
			
			НоваяСтрокаПротокола.Дата                 = ПараметрыСогласования.ТекущаяДата;
			НоваяСтрокаПротокола.Автор                = ПараметрыСогласования.ТекущийПользователь;
			НоваяСтрокаПротокола.ТекстПоручения       = ТекстПоручения;
			НоваяСтрокаПротокола.Статус               = ЗадачаОбъект.Статус;
			НоваяСтрокаПротокола.ИсполнительПоручения = ПараметрыСогласования.Исполнитель;
			
			ЗадачаОбъект.ИсполнительПорученияПоЗадаче = ПараметрыСогласования.Исполнитель;
			ЗадачаОбъект.ТекстПоследнегоПоручения     = ТекстПоручения;
			ЗадачаОбъект.ДатаПорученияПоЗадаче        = ЗадачиПроцессовКлиентСервер.ДатаПорученияПоЗадаче(ЗадачаОбъект,
			                                                                                              ПараметрыСогласования.ТекущийПользователь,
			                                                                                              ПараметрыСогласования.ТекущаяДата);
			
			ЗадачаОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьРасчет", Истина);
			ЗадачаОбъект.Записать();
			
		КонецЕсли;
		
		Если ПересчитыватьИтоги Тогда
			
			РегистрыСведений.ИтогиСогласованияЗадачРесурсов.РассчитатьВсеИтогиДляЗадачи(ПараметрыСогласования.Задача, 
			                                                                            ПараметрыСогласования.СогласуемыйРесурс);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		Успешно = Истина;
		
	Исключение
		
		ВывестиСообщениеОшибкаЗаписи(ЗадачаОбъект, ПараметрыСогласования.Задача);
		
		Успешно = Ложь;
		
		ОтменитьТранзакцию();
	
	КонецПопытки;
	
КонецПроцедуры

Процедура НеСогласоватьРесурсВЗадачеИНаправитьИсполнителю(ПараметрыСогласования) Экспорт
	
	ЗадачаОбъект = Неопределено;
	
	Попытка
		
		НачатьТранзакцию();
	
		НеСогласоватьРесурсВЗадаче(ПараметрыСогласования);
		
		Если ПараметрыСогласования.ТекущийПользователь <> ПараметрыСогласования.Исполнитель
			Или Не ПустаяСтрока(ПараметрыСогласования.ТекстПоручения) Тогда
			
			ЗадачаОбъект = ПараметрыСогласования.Задача.ПолучитьОбъект();
			
			Если ПустаяСтрока(ПараметрыСогласования.ТекстПоручения) Тогда 
				ТекстПоручения = ЗадачиПроцессовКлиентСервер.ТекстРезультатыСогласования(ПараметрыСогласования.ПредставлениеВидаРесурса, 
				                                                                         ПараметрыСогласования.Количество,
				                                                                         0);
			Иначе
				ТекстПоручения = ПараметрыСогласования.ТекстПоручения;
			КонецЕсли;
			
			НоваяСтрокаПротокола = ЗадачаОбъект.ПротоколВзаимодействия.Добавить();
			
			НоваяСтрокаПротокола.Дата                 = ПараметрыСогласования.ТекущаяДата;
			НоваяСтрокаПротокола.Автор                = ПараметрыСогласования.ТекущийПользователь;
			НоваяСтрокаПротокола.ТекстПоручения       = ТекстПоручения;
			НоваяСтрокаПротокола.Статус               = ЗадачаОбъект.Статус;
			НоваяСтрокаПротокола.ИсполнительПоручения = ПараметрыСогласования.Исполнитель;
			
			ЗадачаОбъект.ИсполнительПорученияПоЗадаче = ПараметрыСогласования.Исполнитель;
			ЗадачаОбъект.ТекстПоследнегоПоручения     = ТекстПоручения;
			ЗадачаОбъект.ДатаПорученияПоЗадаче        = ЗадачиПроцессовКлиентСервер.ДатаПорученияПоЗадаче(ЗадачаОбъект,
			                                                                                              ПараметрыСогласования.ТекущийПользователь,
			                                                                                              ПараметрыСогласования.ТекущаяДата);
			
			ЗадачаОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьРасчет", Истина);
			ЗадачаОбъект.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ВывестиСообщениеОшибкаЗаписи(ЗадачаОбъект, ПараметрыСогласования.Задача);
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Конструкторы

Функция ПараметрыСогласованияРесурса() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Задача",                   Справочники.ЗадачиПроцесса.ПустаяСсылка());
	Параметры.Вставить("Исполнитель",              Справочники.Пользователи.ПустаяСсылка());
	Параметры.Вставить("СогласуемыйРесурс",        Справочники.ВидыСогласуемыхРесурсов.ПустаяСсылка());
	Параметры.Вставить("ПредставлениеВидаРесурса", "");
	Параметры.Вставить("Количество",               0);
	Параметры.Вставить("ТекущийПользователь",      Справочники.Пользователи.ПустаяСсылка());
	Параметры.Вставить("ТекущаяДата",              Дата(1, 1, 1));
	Параметры.Вставить("ТекстПоручения",           "");
	Параметры.Вставить("Согласующий",              Справочники.Пользователи.ПустаяСсылка());
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыЧастичногоСогласованияРесурса() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Задача",                   Справочники.ЗадачиПроцесса.ПустаяСсылка());
	Параметры.Вставить("Исполнитель",              Справочники.Пользователи.ПустаяСсылка());
	Параметры.Вставить("СогласуемыйРесурс",        Справочники.ВидыСогласуемыхРесурсов.ПустаяСсылка());
	Параметры.Вставить("ПредставлениеВидаРесурса", "");
	Параметры.Вставить("Согласуется",              0);
	Параметры.Вставить("НеСогласуется",            0);
	Параметры.Вставить("ТекущийПользователь",      Справочники.Пользователи.ПустаяСсылка());
	Параметры.Вставить("ТекущаяДата",              Дата(1, 1, 1));
	Параметры.Вставить("ТекстПоручения",           "");
	Параметры.Вставить("Согласующий",              Справочники.Пользователи.ПустаяСсылка());
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыЗаписи() Экспорт
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Период",             Дата(1,1,1));
	ПараметрыЗаписи.Вставить("Задача",             Справочники.ЗадачиПроцесса.ПустаяСсылка());
	ПараметрыЗаписи.Вставить("ВидРесурса",         Справочники.ВидыСогласуемыхРесурсов.ПустаяСсылка());
	ПараметрыЗаписи.Вставить("СтатусСогласования", Перечисления.СтатусыСогласованияРесурса.ПустаяСсылка());
	ПараметрыЗаписи.Вставить("Количество",         0);
	ПараметрыЗаписи.Вставить("Автор",              Справочники.Пользователи.ПустаяСсылка());
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОтразитьИзмененияПриЗаписиЗадачи(Задача, ТаблицаПланированияРесурса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаЗапланировано.ВидРесурса    КАК ВидРесурса,
	|	ТаблицаЗапланировано.Запланировано КАК Запланировано
	|ПОМЕСТИТЬ ТаблицаЗапланированоТекущая
	|ИЗ
	|	&ТаблицаЗапланировано КАК ТаблицаЗапланировано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПротоколСогласованияРесурсов.ВидРесурса КАК ВидРесурса,
	|	СУММА(ВЫБОР
	|			КОГДА ПротоколСогласованияРесурсов.СтатусСогласования = ЗНАЧЕНИЕ(Перечисление.СтатусыСогласованияРесурса.КСогласованию)
	|				ТОГДА ПротоколСогласованияРесурсов.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ)                             КАК Запланировано
	|ПОМЕСТИТЬ ТаблицаЗапланированоПредыдущая
	|ИЗ
	|	РегистрСведений.ПротоколСогласованияРесурсов КАК ПротоколСогласованияРесурсов
	|ГДЕ
	|	ПротоколСогласованияРесурсов.Задача = &Задача
	|
	|СГРУППИРОВАТЬ ПО
	|	ПротоколСогласованияРесурсов.ВидРесурса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗапланированоТекущая.ВидРесурса                                                                КАК ВидРесурса,
	|	ТаблицаЗапланированоТекущая.Запланировано - ЕСТЬNULL(ТаблицаЗапланированоПредыдущая.Запланировано, 0) КАК Запланировано
	|ИЗ
	|	ТаблицаЗапланированоТекущая КАК ТаблицаЗапланированоТекущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЗапланированоПредыдущая КАК ТаблицаЗапланированоПредыдущая
	|		ПО ТаблицаЗапланированоТекущая.ВидРесурса = ТаблицаЗапланированоПредыдущая.ВидРесурса
	|ГДЕ
	|	ТаблицаЗапланированоТекущая.Запланировано - ЕСТЬNULL(ТаблицаЗапланированоПредыдущая.Запланировано, 0) <> 0";
	
	Запрос.УстановитьПараметр("ТаблицаЗапланировано", ТаблицаПланированияРесурса);
	Запрос.УстановитьПараметр("Задача", Задача);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задача.Установить(Задача);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	ТекущаяДата         = ТекущаяДатаСеанса();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Запланировано <> 0 Тогда
		
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период             = ТекущаяДата;
			НоваяЗапись.Задача             = Задача;
			НоваяЗапись.ВидРесурса         = Выборка.ВидРесурса;
			НоваяЗапись.СтатусСогласования = Перечисления.СтатусыСогласованияРесурса.КСогласованию;
			НоваяЗапись.Количество         = Выборка.Запланировано;
			НоваяЗапись.Автор              = ТекущийПользователь;
		
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиСообщениеОшибкаЗаписи(ЗадачаОбъект, ЗадачаСсылка) 
		
		ДанныеЗадачи = ДанныеЗадачиДляВыводаОшибки(ЗадачаОбъект, ЗадачаСсылка);
		ТекстОшибки  = СтрШаблон(НСтр("ru='Не удалось записать %1. %2'"), ДанныеЗадачи.Наименование, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ДанныеЗадачи.Ссылка);
		
КонецПроцедуры

Функция ДанныеЗадачиДляВыводаОшибки(ЗадачаОбъект, ЗадачаСсылка)
	
	ДанныеЗадачи = Новый Структура;
	ДанныеЗадачи.Вставить("Наименование", "");
	ДанныеЗадачи.Вставить("Ссылка",       ЗадачаСсылка);
	
	Если ЗадачаОбъект = Неопределено Тогда
		ДанныеЗадачи.Наименование = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗадачаСсылка, "Наименование", Истина);
	Иначе
		ДанныеЗадачи.Наименование = ЗадачаОбъект.Наименование;
	КонецЕсли;

	Возврат ДанныеЗадачи;
	
КонецФункции

#КонецОбласти

#КонецЕсли
